src/cf/Catalogs/Activities.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Activities</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Package</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Packages</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Basic</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Advance</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Pro</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Picture</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalInformation</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/ActivityList/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	// Insert handler content 
	Query = New Query;
	Query.Text = "SELECT
	|	Activities.Ref AS Activity
	|FROM
	|	Catalog.Activities AS Activities";
	
	//Query.SetParameter("", );
	
	Result = Query.Execute();
	Selection = Result.Choose();
	
	While Selection.Next() Do
		NewLine = ActivitiesList.Add();
		NewLine.Activity = Selection.Activity;
		If Selection.Activity.Package = Catalogs.Packages.Basic Then
			NewLine.Basic = True;
		ElsIf Selection.Activity.Package = Catalogs.Packages.Advance Then
			NewLine.Advanced = True;
		Else 
			NewLine.Pro = True;
		EndIf;
	EndDo;
EndProcedure
